cfg/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗОТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоДРФО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФизическихЛиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСемьи</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодРождения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Иждивенец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбразования</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбразованияФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диплом</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УченаяСтепень</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОбучения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрудоваяДеятельность</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗнаниеЯзыков</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньЗнанияЯзыка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Профессии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профессия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофессииРабочих</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Стажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтажа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬДатаОтсчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬРазмерМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬРазмерДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/CommonForms/ФормаВыбораРаботникаОрганизации/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем СтруктураПоиска;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПолучитьДанные()
	
	ПустаяДата = Дата("00010101");
	Запрос = Новый Запрос();
	
	ТекстУсловияОрганизации = "";
	ТекстУсловияОрганизацииСрез = ""; 
	ТекстУсловияПодразделение = ""; 
	ТекстУсловияПодразделениеДоговориники = ""; 
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстУсловияОрганизацииСрез = " И Организация = &ГоловнаяОрганизация";
		ТекстУсловияОрганизации = " И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация";
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
	КонецЕсли;
	Если НЕ ПодразделениеОрганизации.Пустая() Тогда
		ТекстУсловияПодразделение = " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)";
		ТекстУсловияПодразделениеДоговориники = " И РаботникиОрганизаций.Договор.ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)";
	КонецЕсли;
	
	
	ТекстЗапросаРеквизиты = "
	|	РаботникиОрганизаций.Сотрудник.Физлицо                     КАК Физлицо,
	|	РаботникиОрганизаций.Сотрудник.Физлицо.Наименование        КАК ФизлицоНаименование,
	|	РаботникиОрганизаций.ПодразделениеОрганизации              КАК ПодразделениеОрганизации,
	|	РаботникиОрганизаций.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизаций.Должность                             КАК Должность,
	|	РаботникиОрганизаций.Должность.Наименование                КАК ДолжностьНаименование,
	|	РаботникиОрганизаций.Сотрудник.Код                         КАК ТабельныйНомер,
	|	РаботникиОрганизаций.ЗанимаемыхСтавок                      КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизаций.ГрафикРаботы                          КАК ГрафикРаботы
	|";
	
	ТекстЗапросаДанныеПустойПериод = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ " + ТекстЗапросаРеквизиты + "
	|ИЗ  РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Активность = ИСТИНА " + ТекстУсловияОрганизацииСрез + " ) КАК РаботникиОрганизаций
	|ГДЕ РаботникиОрганизаций.ЗанимаемыхСтавок > 0
	|  " + ТекстУсловияПодразделение + "
	|";
	
	ТекстЗапросаДанныеНачПериода = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ " + ТекстЗапросаРеквизиты + "
	|ИЗ  РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачПериода, Активность = ИСТИНА " + ТекстУсловияОрганизацииСрез + " ) КАК РаботникиОрганизаций
	|ГДЕ РаботникиОрганизаций.ЗанимаемыхСтавок > 0
	|  " + ТекстУсловияПодразделение + "
	|";
	
	ТекстЗапросаДанныеНачПериодаКонПериода = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ " + ТекстЗапросаРеквизиты + "
	|ИЗ  РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ РаботникиОрганизаций.ЗанимаемыхСтавок > 0
	|	И	РаботникиОрганизаций.Период >= &НачПериода
	|	И	РаботникиОрганизаций.Период <= &КонПериода
	|   И	РаботникиОрганизаций.Активность = ИСТИНА 
	|  " + ТекстУсловияОрганизации + "
	|  " + ТекстУсловияПодразделение + "
	|"; 
	
	Если НачПериода = ПустаяДата И КонПериода = ПустаяДата Тогда
		ТекстЗапроса = 	ТекстЗапросаДанныеПустойПериод
	ИначеЕсли НачПериода <> ПустаяДата И КонПериода <> ПустаяДата Тогда
		ТекстЗапроса = 	ТекстЗапросаДанныеНачПериода  + "
		|
		|ОБЪЕДИНИТЬ
		|"+ТекстЗапросаДанныеНачПериодаКонПериода;
	ИначеЕсли НачПериода <> ПустаяДата Тогда
		ТекстЗапроса = 	ТекстЗапросаДанныеНачПериода;
	Иначе
		ТекстЗапроса = 	ТекстЗапросаДанныеНачПериодаКонПериода;
	КонецЕсли;
	
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизлицоНаименование";
	
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустойПриказ", Документы.ПриемНаРаботуВОрганизацию.ПустаяСсылка());
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
	КонецЕсли;
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДолжность", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	СписокРаботниковОрганизации = Запрос.Выполнить().Выгрузить();

	// устанавливает текущую позицию
	СтруктураПоиска = Новый Структура("Физлицо");
	СтруктураПоиска.Физлицо = ПараметрФизлицо;
	
	Строки = СписокРаботниковОрганизации.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество() > 0 Тогда
		ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяСтрока = Строки[0];
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если ПараметрУникальность Тогда
		СтруктураПоиска = Новый Структура("Физлицо");
	Иначе
		СтруктураПоиска = Новый Структура("Физлицо, Приказ"); 
	КонецЕсли;
	
	// получить данные
	ПолучитьДанные();
	
	// сформировать колонки табличного поля
	КолонкаТабельныйНомер = ЭлементыФормы.СписокРаботниковОрганизации.Колонки.Добавить("ТабельныйНомер", "Табельный №");
	КолонкаТабельныйНомер.Данные = "ТабельныйНомер";
	ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяКолонка = КолонкаТабельныйНомер;
	
	КолонкаФизлицо = ЭлементыФормы.СписокРаботниковОрганизации.Колонки.Добавить("ФизлицоНаименование", "Работник");
	КолонкаФизлицо.Данные = "ФизлицоНаименование";
	
	КолонкаПодразделениеОрганизации = ЭлементыФормы.СписокРаботниковОрганизации.Колонки.Добавить("ПодразделениеОрганизацииНаименование", "Подразделение");
	КолонкаПодразделениеОрганизации.Данные = "ПодразделениеОрганизацииНаименование";
	
	КолонкаДолжность = ЭлементыФормы.СписокРаботниковОрганизации.Колонки.Добавить("ДолжностьНаименование", "Должность");
	КолонкаДолжность.Данные = "ДолжностьНаименование";
	
	КолонкаГрафикРаботы = ЭлементыФормы.СписокРаботниковОрганизации.Колонки.Добавить("ГрафикРаботы", "ГрафикРаботы");
	КолонкаГрафикРаботы.Данные = "ГрафикРаботы";
	
	КолонкаПриказ = ЭлементыФормы.СписокРаботниковОрганизации.Колонки.Добавить("Приказ", "Приказ");
	КолонкаПриказ.Данные = "Приказ";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура ДействияФормыОбновитьСписок(Кнопка)
	// получить данные
	Если ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяСтрока = НеОпределено Тогда
		ПараметрФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		ПараметрПриказ = Документы.ПриемНаРаботуВОрганизацию.ПустаяСсылка();
		
	Иначе
		ПараметрФизлицо = ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяСтрока.Физлицо;
		ПараметрПриказ = ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяСтрока.Приказ;
		
	КонецЕсли;
	
	ПолучитьДанные();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

Процедура ОрганизацияПриИзменении(Элемент)
	ПолучитьДанные();
	
КонецПроцедуры

Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	// получить данные
	Если ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяСтрока = НеОпределено Тогда
		ПараметрФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		ПараметрПриказ = Документы.ПриемНаРаботуВОрганизацию.ПустаяСсылка();
		
	Иначе
		ПараметрФизлицо = ЭлементыФормы.СписокРаботниковОрганизации.ТекущаяСтрока.Физлицо;
	КонецЕсли;
	
	ПолучитьДанные();
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.Редактировать();
	НачПериода = НастройкаПериода.ПолучитьДатуНачала();
	КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
		
	// получить данные
	ПолучитьДанные();
КонецПроцедуры

Процедура НачПериодаПриИзменении(Элемент)
		
	// получить данные
	ПолучитьДанные();

КонецПроцедуры

Процедура КонПериодаПриИзменении(Элемент)
			
	// получить данные
	ПолучитьДанные();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ

Процедура СписокРаботниковОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	////Если РежимВыбора Тогда
	////	
	////	ВыбранныйНаборДанных = Новый Структура("Физлицо
	////	|, Приказ
	////	|, ПодразделениеОрганизации
	////	|, Должность
	////	|, ТабельныйНомер
	////	|, ЗанимаемыхСтавок
	////	|, ГрафикРаботы"
	////	, Элемент.ТекущаяСтрока.Физлицо
	////	, Элемент.ТекущаяСтрока.Приказ
	////	, Элемент.ТекущиеДанные.ПодразделениеОрганизации
	////	, Элемент.ТекущиеДанные.Должность
	////	, Элемент.ТекущиеДанные.ТабельныйНомер
	////	, Элемент.ТекущиеДанные.ЗанимаемыхСтавок
	////	, Элемент.ТекущиеДанные.ГрафикРаботы);
	////	
	////	ОповеститьОВыборе(ВыбранныйНаборДанных);
	////Иначе
	////	ВыбраннаяСтрока.Физлицо.ПолучитьФорму().Открыть();
	////КонецЕсли;
	////СтандартнаяОбработка = Ложь;
	
	Если РежимВыбора Тогда
		
		ПриказПустаяСсылка = Документы.ПриемНаРаботуВОрганизацию.ПустаяСсылка();
		Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		Должность = Справочники.ДолжностиОрганизаций.ПустаяСсылка();
		ВыбранныйНаборДанных = Новый Структура("Физлицо, ПодразделениеОрганизации, Должность, ГрафикРаботы, ТабельныйНомер",Элемент.ТекущаяСтрока.Физлицо, Элемент.ТекущаяСтрока.ПодразделениеОрганизации, Элемент.ТекущаяСтрока.Должность, Элемент.ТекущаяСтрока.ГрафикРаботы, Элемент.ТекущаяСтрока.ТабельныйНомер);
		ОповеститьОВыборе(ВыбранныйНаборДанных);
	Иначе
		ВыбраннаяСтрока.Физлицо.ПолучитьФорму().Открыть();
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура СписокРаботниковОрганизацииПередНачаломИзменения(Элемент, Отказ)
	Элемент.ТекущаяСтрока.Физлицо.ПолучитьФорму().Открыть();
	Отказ = Истина;
КонецПроцедуры
